In [1]:
import os

In [ ]:
Write a Python program to remove the characters which have odd index values of a given string.

In [5]:
def is_odd(n):
    return n % 2!=0

In [7]:
is_odd(11)

True

In [ ]:
x = "qwertyuiop"

In [11]:
result = ""
for i,char in enumerate(x):
    if is_odd(i):
        continue
    else:
        result = result + char

result

'qetuo'

In [ ]:
Python Program for cube sum of first n natural numbers.

In [17]:
n = 3
sum = 0
for i in range(n):
    print(i+1)
    sum =  sum + (i+1)**3

sum

1
2
3

36

Write a program to make a new string with all the consonants deleted from the string "Hello, have a good day".

In [ ]:
id| salary
1|6000

2|5000

3|5000

4|3000

5|7000

In [ ]:
df = spark.read.csv(path= "/data/data.csv")

In [ ]:
select
id, 
salary as secondhighest
(
select
id,
salary,
row_number() over (partition by id order by salary) as rn 
)
where rn = 2

In [ ]:
eid| ename | mid
1|Aviral|Null
2|Mayank|1
3|Raj|1
4|Mahesh|3
5|Kumar|2

In [ ]:
select
e.eid,
e.ename,
m.ename
from office e 
join office m 
on e.mid = m.eid

ColumnA	ColumnB

1	 	1

1	 	1

1	 	2

2	 	NULL

2	 	3

NULL	3

3	 	4

3	 	6

4	 	 

5	 	 

NULL

inner:

1: 6
2: 2
3: 4
4: 1
14

left outer:

team1		team2		result

 

India		Pakistan	India

 

England		Afghanistan	Afghanistan

 

Australia	India		India

 

Sri Lanka	Bangladesh	Sri Lanka

 

 

England		Pakistan	England

 

Australia	New Zealand	Australia

select 

case when team1 is not in (result) then score=0

(
    select
count(result) as score,
result
from teams
group by result
) sub

In [ ]:
CREATE TABLE results (
    team1 VARCHAR(50),
    team2 VARCHAR(50),
    result VARCHAR(50)
);

-- Insert data into the results table
INSERT INTO results (team1, team2, result) VALUES
('India', 'Pakistan', 'India'),
('England', 'Afghanistan', 'Afghanistan'),
('Australia', 'India', 'India'),
('Sri Lanka', 'Bangladesh', 'Sri Lanka'),
('England', 'Pakistan', 'England'),
('Australia', 'New Zealand', 'Australia');